/*
 * Localizable.strings (English)
 * PushToTalk
 */

// MARK: - Application

"app.name" = "PushToTalk";
"app.settings" = "Settings";
"app.quit" = "Quit";
"app.about" = "About";

// MARK: - Menu Bar

"menubar.recording" = "Recording";
"menubar.ready" = "Ready";
"menubar.processing" = "Processing";
"menubar.error" = "Error";
"menubar.settings" = "Settings";
"menubar.audioDevice" = "Audio Device";
"menubar.noDevicesAvailable" = "No devices available";
"menubar.refreshList" = "Refresh List";
"menubar.quit" = "Quit";
"menubar.deviceChanged" = "Audio device changed";
"menubar.selectedDevice" = "Selected:";
"menubar.listRefreshed" = "List refreshed";
"menubar.devicesFound" = "Devices found:";

// MARK: - Settings Sections

"sections.debug" = "Debug";
"sections.general" = "General";
"sections.models" = "Models";
"sections.hotkeys" = "Hotkeys";
"sections.vocabulary" = "Vocabulary";
"sections.audio" = "Audio";
"sections.history" = "History";

// MARK: - General Settings

"general.title" = "General Settings";
"general.stopWords" = "Stop Words";
"general.stopWordsDescription" = "Words that cancel recording";
"general.addStopWord" = "Add Stop Word";
"general.maxRecordingDuration" = "Max Recording Duration";
"general.maxRecordingDescription" = "Maximum recording time in seconds";
"general.seconds" = "seconds";

// MARK: - Model Settings

"models.title" = "Model Settings";
"models.currentModel" = "Current Model";
"models.availableModels" = "Available Models";
"models.downloadModel" = "Download Model";
"models.deleteModel" = "Delete Model";
"models.modelSize" = "Model Size";
"models.modelStatus" = "Model Status";
"models.downloaded" = "Downloaded";
"models.notDownloaded" = "Not Downloaded";
"models.downloading" = "Downloading";
"models.deleteConfirmation" = "Are you sure you want to delete the %@ model? This action cannot be undone.";
"models.deleteTitle" = "Delete Model";
"models.cancel" = "Cancel";
"models.delete" = "Delete";

// MARK: - Hotkey Settings

"hotkeys.title" = "Hotkey Settings";
"hotkeys.currentHotkey" = "Current Hotkey";
"hotkeys.recordNewHotkey" = "Record New Hotkey";
"hotkeys.pressHotkey" = "Press hotkey combination";
"hotkeys.functionKeys" = "Function Keys";
"hotkeys.modifiers" = "Modifiers";
"hotkeys.noModifier" = "No Modifier";

// MARK: - Vocabulary Settings

"vocabulary.title" = "Vocabulary Settings";
"vocabulary.customPrompt" = "Custom Prompt";
"vocabulary.customPromptDescription" = "Additional terms for better recognition";
"vocabulary.programmingPrompt" = "Use Programming Prompt";
"vocabulary.programmingPromptDescription" = "Include common programming terms";
"vocabulary.vocabularies" = "Custom Vocabularies";
"vocabulary.addVocabulary" = "Add Vocabulary";
"vocabulary.vocabularyName" = "Vocabulary Name";
"vocabulary.words" = "Words";
"vocabulary.wordsPlaceholder" = "Enter words separated by commas";
"vocabulary.enabled" = "Enabled";
"vocabulary.disabled" = "Disabled";
"vocabulary.language" = "Language";
"vocabulary.languageDescription" = "Transcription language";
"vocabulary.russian" = "Russian";
"vocabulary.english" = "English";

// MARK: - Audio Settings

"audio.title" = "Audio Settings";
"audio.inputDevice" = "Input Device";
"audio.inputDeviceDescription" = "Microphone for recording";
"audio.defaultDevice" = "Default Device";
"audio.testRecording" = "Test Recording";
"audio.stopTest" = "Stop Test";
"audio.soundEffects" = "Sound Effects";
"audio.soundEffectsDescription" = "Play sounds on recording start/stop";
"audio.audioDucking" = "Audio Ducking";
"audio.audioDuckingDescription" = "Lower media volume during recording";
"audio.microphoneVolume" = "Microphone Volume";
"audio.volumeBoost" = "Volume Boost";

// MARK: - History Settings

"history.title" = "Transcription History";
"history.noEntries" = "No transcriptions yet";
"history.entries" = "entries";
"history.copyToClipboard" = "Copy to Clipboard";
"history.deleteEntry" = "Delete Entry";
"history.clearHistory" = "Clear History";
"history.clearConfirmation" = "Are you sure you want to clear all history?";
"history.clearTitle" = "Clear History";
"history.exportHistory" = "Export History";
"history.exportSuccess" = "Export Successful";
"history.exportSuccessMessage" = "History exported to Downloads folder";
"history.ok" = "OK";

// MARK: - Debug Settings

"debug.title" = "Debug Settings";
"debug.viewLogs" = "View Logs";
"debug.openLogFolder" = "Open Log Folder";
"debug.clearLogs" = "Clear Logs";
"debug.enableDebugMode" = "Enable Debug Mode";
"debug.debugModeDescription" = "Show detailed debug information";
"debug.performanceMetrics" = "Performance Metrics";
"debug.showMetrics" = "Show Performance Metrics";
"debug.realTimeFactor" = "Real-Time Factor";
"debug.transcriptionSpeed" = "Transcription Speed";

// MARK: - File Transcription

"fileTranscription.title" = "File Transcription";
"fileTranscription.mode" = "Transcription Mode";
"fileTranscription.vadMode" = "VAD (Voice Activity Detection)";
"fileTranscription.vadModeDescription" = "Automatic speech segment detection. Recommended for most cases.";
"fileTranscription.batchMode" = "Batch (fixed chunks)";
"fileTranscription.batchModeDescription" = "Split into equal parts with overlap. Alternative method.";
"fileTranscription.vadAlgorithm" = "VAD Algorithm";
"fileTranscription.selectFile" = "Select File";
"fileTranscription.startTranscription" = "Start Transcription";
"fileTranscription.stopTranscription" = "Stop Transcription";
"fileTranscription.progress" = "Progress";
"fileTranscription.transcribing" = "Transcribing";

// MARK: - Permissions

"permissions.microphoneRequired" = "Microphone Permission Required";
"permissions.microphoneDescription" = "PushToTalk needs microphone access to record audio";
"permissions.openSettings" = "Open Settings";
"permissions.permissionDenied" = "Permission Denied";

// MARK: - Errors

"errors.title" = "Error";
"errors.modelLoadFailed" = "Failed to load model";
"errors.modelNotSupported" = "Model not supported";
"errors.modelDownloadFailed" = "Failed to download model";
"errors.modelDeleteFailed" = "Failed to delete model";
"errors.recordingFailed" = "Failed to start recording";
"errors.transcriptionFailed" = "Transcription failed";
"errors.audioDeviceError" = "Audio device error";
"errors.unknownError" = "An unknown error occurred";
"errors.tryAgain" = "Try Again";
"errors.dismiss" = "Dismiss";

// MARK: - Status Messages

"status.ready" = "Ready";
"status.recording" = "Recording...";
"status.processing" = "Processing...";
"status.transcribing" = "Transcribing...";
"status.completed" = "Completed";
"status.cancelled" = "Cancelled";
"status.modelLoading" = "Loading model...";
"status.modelLoaded" = "Model loaded";

// MARK: - Buttons

"buttons.ok" = "OK";
"buttons.cancel" = "Cancel";
"buttons.delete" = "Delete";
"buttons.save" = "Save";
"buttons.apply" = "Apply";
"buttons.close" = "Close";
"buttons.done" = "Done";
"buttons.add" = "Add";
"buttons.remove" = "Remove";
"buttons.edit" = "Edit";
"buttons.export" = "Export";
"buttons.import" = "Import";

// MARK: - Units

"units.seconds" = "s";
"units.minutes" = "min";
"units.hours" = "h";
"units.kilobytes" = "KB";
"units.megabytes" = "MB";
"units.gigabytes" = "GB";

// MARK: - Quality Enhancement

"quality.title" = "Quality Enhancement";
"quality.enabled" = "Enable Quality Enhancement";
"quality.enabledDescription" = "Use advanced settings for better transcription quality";
"quality.temperatureFallback" = "Temperature Fallback";
"quality.temperatureFallbackDescription" = "Multiple attempts with different temperatures";
"quality.compressionRatio" = "Compression Ratio Threshold";
"quality.compressionRatioDescription" = "Filter hallucinations (default: 2.4)";
"quality.logProbThreshold" = "Log Probability Threshold";
"quality.logProbThresholdDescription" = "Filter low-confidence results (default: -1.0)";

// MARK: - VAD Algorithms

"vadAlgorithms.spectralTelephone" = "Spectral VAD - Telephone (recommended)";
"vadAlgorithms.spectralTelephoneDescription" = "FFT analysis for telephone audio (300-3400 Hz). Best for call recordings.";
"vadAlgorithms.spectralWideband" = "Spectral VAD - Wideband";
"vadAlgorithms.spectralWidebandDescription" = "FFT analysis for wideband audio (80-8000 Hz). For quality recordings.";
"vadAlgorithms.spectralDefault" = "Spectral VAD - Default";
"vadAlgorithms.spectralDefaultDescription" = "FFT analysis, standard mode. Universal option.";
"vadAlgorithms.adaptiveLowQuality" = "Adaptive VAD - Low Quality";
"vadAlgorithms.adaptiveLowQualityDescription" = "Adaptive threshold + ZCR for low quality. Auto-adjusts to noise.";
"vadAlgorithms.adaptiveAggressive" = "Adaptive VAD - Aggressive";
"vadAlgorithms.adaptiveAggressiveDescription" = "Aggressive segmentation. Many short segments.";
"vadAlgorithms.standardLowQuality" = "Standard VAD - Low Quality";
"vadAlgorithms.standardLowQualityDescription" = "Energy method for telephone audio. Simple and fast.";
"vadAlgorithms.standardHighQuality" = "Standard VAD - High Quality";
"vadAlgorithms.standardHighQualityDescription" = "Energy method for clean audio. More accurate segmentation.";

// MARK: - Notifications

"notifications.recordingStarted" = "Recording started";
"notifications.recordingStopped" = "Recording stopped";
"notifications.transcriptionCompleted" = "Transcription completed";
"notifications.modelChanged" = "Model changed to %@";
"notifications.modelDownloaded" = "Model %@ downloaded";
"notifications.modelDeleted" = "Model %@ deleted";

// MARK: - General Settings (Additional)

"general.stopWordsTitle" = "Stop Words";
"general.recordingSettings" = "Recording Settings";

// MARK: - Hotkeys (Additional)

"hotkeys.hotkeySelection" = "Hotkey Selection";
"hotkeys.activeHotkey" = "Active Hotkey";
"hotkeys.hotkey" = "Hotkey";
"hotkeys.presetMode" = "Preset F-Keys";
"hotkeys.customMode" = "Custom Hotkey";
"hotkeys.modeSelection" = "Hotkey Mode";
"hotkeys.accessibilityRequired" = "Accessibility permission required for custom hotkeys";

// Key constraints UI
"hotkeys.allowedKeys" = "Allowed keys:";
"hotkeys.fKeysAllowed" = "F1–F19 without modifiers";
"hotkeys.modifierKeysAllowed" = "Any key with ⌘ / ⌥ / ⌃ modifier";
"hotkeys.plainKeysNotAllowed" = "Plain letter/symbol keys are not allowed (conflict with text input)";
"hotkeys.recommendedKeys" = "Recommended Keys";
"hotkeys.recommendedF13F19" = "F13–F19: Rarely used by other apps";
"hotkeys.recommendedOption" = "⌥+key: Option + any letter/number (e.g. ⌥F or ⌥`)";
"hotkeys.recommendedControl" = "⌃+key: Control + any key";
"hotkeys.avoidF1F12" = "Avoid: F1–F12 (system media/brightness keys)";
"hotkeys.avoidSystemShortcuts" = "Avoid: ⌘Q, ⌘W, ⌘Tab (system shortcuts)";
"hotkeys.howToUse" = "How to Use";
"hotkeys.howToUseHold" = "Press and hold the hotkey to start recording";
"hotkeys.howToUseRelease" = "Release the hotkey to transcribe";
"hotkeys.howToUseInsert" = "Text will be inserted at cursor position";
"hotkeys.accessibilityDescription" = "PushToTalk requires Accessibility permissions to capture hotkeys and insert transcribed text.";
"hotkeys.openSystemSettings" = "Open System Settings";
"hotkeys.accessibilityDisabledHint" = "Enable Accessibility permissions to customize hotkey";

// Recorder
"hotkeys.pressAnyKey" = "Press any key...";
"hotkeys.clickToRecord" = "Click to record...";
"hotkeys.recording" = "Recording...";
"hotkeys.addMainKey" = "Add a main key to modifier";
"hotkeys.needModifierOrFKey" = "Need ⌘/⌥/⌃ modifier or use F1–F19";
"hotkeys.dangerousCombination" = "System combination not allowed";
"hotkeys.recorderHint" = "F1–F19 without modifiers or any key with ⌘ / ⌥ / ⌃. ESC to cancel.";

// MARK: - Vocabulary (Additional)

"vocabulary.addNewVocabulary" = "Add New Vocabulary";

// MARK: - Audio (Additional)

"audio.audioInput" = "Audio Input";
"audio.audioSettings" = "Audio Settings";

// MARK: - History (Additional)

"history.testRecording" = "Test Recording";
"history.noTranscriptions" = "No transcriptions yet";
"history.pressHotkeyToRecord" = "Press and hold the hotkey to start recording";
"history.recording" = "Recording...";
"history.total" = "Total:";
"history.words" = "Words:";
"history.avgTime" = "Avg Time:";
"history.copy" = "Copy";
"history.export" = "Export";
"history.clearAll" = "Clear All";

// MARK: - Debug (Additional)

"debug.mediaRemoteControls" = "MediaRemote Controls";
"debug.pause" = "Pause";
"debug.resume" = "Resume";
"debug.togglePlayPause" = "Toggle Play/Pause";
"debug.getNowPlayingInfo" = "Get Now Playing Info";
"debug.audioDucking" = "Audio Ducking";
"debug.duck" = "Duck";
"debug.unduck" = "Unduck";
"debug.microphoneVolume" = "Microphone Volume";
"debug.boost" = "Boost";
"debug.restore" = "Restore";
"debug.logs" = "Logs";
"debug.copyCommand" = "Copy Command";
≨潴步祳⹨潴步祓敬散瑩潮∠㴠≈潴步礠卥汥捴楯渢㬊≨潴步祳⹡捴楶效潴步礢‽•䅣瑩癥⁈潴步礢㬊≨潴步祳⹨潴步礢‽•䡯瑫敹∻ਢ桯瑫敹献灲敳整䵯摥∠㴠≐牥獥琠䘭䭥祳∻ਢ桯瑫敹献捵獴潭䵯摥∠㴠≃畳瑯洠䡯瑫敹∻ਢ桯瑫敹献浯摥卥汥捴楯渢‽•䡯瑫敹⁍潤攢㬊≨潴步祳⹡捣敳獩扩汩瑹剥煵楲敤∠㴠≁捣敳獩扩汩瑹⁰敲浩獳楯渠牥煵楲敤⁦潲⁣畳瑯洠桯瑫敹猢㬊